org/magit_tips.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEING_EXPORT html
---
layout: default
title: Magit Tips
---
#+END_EXPORT
* Magit Tips
** Creating Branches
An extremely annoying error while learning magit branch workflows is the following:
Not a valid starting-point: <my_branch>

Where does this come from, and how do we resolve it? 

Recall that to check out a branch from magit, after navigating to the magit-status page, we press b n

Then, magit will ask you for your starting place. This is actually very helpful - we frequently want to create a branch not from master, but from some other existing branch. But here in lies the issue. It's asking for the starting place. 

Be careful: magit is NOT asking you to name your new branch yet. If you choose a branch that does not exist, you will see the following:

Not a valid starting-point: my-new-branch

... so -- choose a branch that exists! THEN magit will ask you to create your branch.
